//帮助
event [me,msg] (user: "", content:"^/帮助")  => {
             drrr.dm(user,"指令列表5：\n【/抽签】\n※每月1、5、10、15、20、25、30日开放")
  later 1000 drrr.dm(user,"指令列表4：\n【/捕捉】【/观察】\n【/宠物】【/全部宠物】\n【/投喂 宠物编号】【/放生 宠物编号】\n【/更改宠物名 宠物编号 新名字】")
  later 2000 drrr.dm(user,"指令列表3：\n【/背包】【/赠送 对方用户名 物品名】\n【/商店】【/集市】\n【/买 数字编号】【/卖 物品名 价格】")
  later 3000 drrr.dm(user,"指令列表2：\n【/签到】\n【/领取奖励】\n【/排行榜】【/个人】\n【/发红包 个数 金额】\n【/抢】【/红包】\n【/转账 对方用户名 金额】")
  later 4000 drrr.dm(user,"指令列表1：\n【/注文 饮品或食物】\n【/买彩票 金额】【/彩票】【/开奖结果】\n【/抽奖】【/刮刮乐】\n【/帮助】" )
}
 //高级帮助
 event [dm] (user: "", content:"/adh")  => {
  drrr.dm(user,"高级指令：\n 踢人：【/踢】【/kick】\n ban人：【/ban】\n ban人【/ban】\n让小粒说：【/说】\n房间主题：【/主题】")
 }
