//帮助
event [me,msg] (user: "", content:"/帮助")  => {
             drrr.dm(user,"指令列表4：\n【/抽签】\n※每月1、5、10、15、20、25、30日开放")
  later 1000 drrr.dm(user,"指令列表3：\n【/悄悄话 对方用户名 内容】 \n※请私信小粒发送，公屏无效，可以发送给不在房间内的用户，当TA进入房间就会收到小粒转发的私信。")
  later 2000 drrr.dm(user,"指令列表2：\n【/签到】【/挂机】\n【/排行榜】【/个人】\n【/发红包 个数 金额】\n【/抢】【/红包】\n【/转账 对方用户名 金额】")
  later 3000 drrr.dm(user,"指令列表1：\n【/抽奖】【/概率】\n【/中奖历史】【/再来一杯】\n【/注文 饮品或食物】\n【/投喂】【/喂食】\n【/套餐】【/帮助】\n※所有指令只适配简体字。" )
}
 //高级帮助
 event [dm] (user: "", content:"/adh")  => {
  drrr.dm(user,"高级指令：\n 踢人：【/踢】【/kick】\n ban人：【/ban】\n ban人【/ban】\n让小粒说：【/说】\n房间主题：【/主题】")
 }
